# получить посты определенного тега+
# Получить все комментарии к публикации+
# Получить всех лайкнувних публикацию (разработать сериализатор Пользователя)+
# Лайкнуть комментарий+
# Подписки на пользователя+

#сделать авторизацию+
# фильтровать показывать подписки и подписчиков пользователя по ИД+
#TODO: дать возможность удалить подписку только после аcx вторизации и только тех кто подписан на авторизованного
#TODO: подписки на хештеги
#TODO: pagination settings
#TODO: редактирование?
#TODO: поледние публикации
#TODO: регистрация , авторизироваться
#TODO: публикация поста с тегами, картинкой
#TODO: сделать ьэйн, там будет лента в хронологическом порядке последних постов от подписаок его
#подписка на тег+
#перейдя по тегу, посмотреть посты этого тега+
#TODO: Просмотр ленты подписок

# Регистрация и вход+
# Создать пост ( с изображение и тегами)+
# Лак чужого поста ( запрет на лайки своего поста)+
# Подписаться на другого пользователя+

# Просмотр ленты постов Тега+
# TODO:Просмотр Деталей Поста (кто лайкнул, когда лайкнул)
#TODO: переделать аватар в модель media

# Курсовой

# Регистрация и вход
# Создать пост ( с изображение и тегами)+
# Лак чужого поста ( запрет на лайки своего поста)+
# Подписаться на другого пользователя+
# Просмотр ленты подписок
# Просмотр ленты постов Тега
# Просмотр Деталей Поста (кто лайкнул, когда лайкнул)

