
# 2. Облако Тегов (линкованное)
# Вывести в блоке список тего с сортировкой использования
# 2.1 TODO: Количество использований рядом с ссылкой

# cтраница публикаций тега
# APi интерфейс получить все посты
# получить все теги

# получить посты определенного тега
# Получить все комментарии к публикации
# Получить всех лайкнувних публикацию (разработать сериализатор Пользователя)
# Лайкнуть комментарий
# Подписки на пользователя

#TODO: сделать авторизацию
#TODO: фильтровать показывать подписки и подписчиков пользователя по ИД
#TODO: дать возможность удалить подписку только после авторизации и только тех кто подписан на авторизованного
#TODO: подписки на хештеги
#TODO: pagination settings
#TODO: редактирование?
#TODO: поледние публикации
#TODO: регистрация , авторизироваться
#TODO: публикация поста с тегами, картинкой
#TODO: сделать ьэйн, там будет лента в хронологическом порядке последних постов от подписаок его
#TODO: подписка на тег
#TODO:перейдя по тегу, посмотреть посты этого тега


# Регистрация и вход
# Создать пост ( с изображение и тегами)
# Лак чужого поста ( запрет на лайки своего поста)
# Подписаться на другого пользователя
# Просмотр ленты подписок
# Просмотр ленты постов Тега
# Просмотр Деталей Поста (кто лайкнул, когда лайкнул)

